# DividedpathMaxDistance Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DividedpathMaxDistance Property
ParameterTypeId Class See Also
---
"Maximum Distance"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DividedpathMaxDistance { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DividedpathMaxDistance As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DividedpathMaxDistance {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace